# [문제]
#     서울숲 일별 평균 대기 오염도 데이터베이스에는 2022년 1년 동안 서울숲 측정소에서 측정한 일별 평균 대기질 정보가 들어있습니다. 공기질 지수에 관한 정보에 따르면, 야외 활동을 하기에 좋은 대기 상태는 초미세먼지(PM2.5) 농도가 9㎍/㎥ 이하여야 합니다.
#     2022년 12월 중 서울숲에 놀러가 야외 활동을 하기 좋은 날을 출력하는 쿼리를 작성해주세요. 쿼리 결과에는 날짜가 출력되는 컬럼 하나만 있어야 하며, 날짜는 오름차순으로 정렬되어 있어야 합니다.
#     good_day: 서울숲에서 야외 활동을 하기 좋은 날

# [해결 방법]
# - 조건: 2022년 12월 중 야외 활동하기 좋은 날(PM2.5 농도가 9 이하)
# - 추출 스키마: 날짜(good_day)
# - 정렬: 날짜(good_day) 오름차순(ASC)

# [풀이]
SELECT measured_at AS good_day
FROM measurements
WHERE 1=1
AND measured_at BETWEEN "2022-12-01" AND "2022-12-31"
AND pm2_5 <= 9
ORDER BY measured_at ASC
;

# [개념 정리]
# - BETWEEN: 
